Revit 2026 API

# BoundingBoxXYZMaxEnabled Property

---

Defines whether the maximum bound is active for given dimension.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool this[
	int dim
] { get; set; }
```
```vb
Public Property MaxEnabled (
	dim As Integer
) As Boolean
	Get
	Set
```
```cpp
public:
property bool MaxEnabled[int dim] {
	bool get (int dim);
	void set (int dim, bool value);
}
```
```fsharp
member MaxEnabled : bool with get, set
```

#### Parameters

dim Int32

#### Property Value

Boolean

Use 0 for X, 1 for Y and 2 for Z. The entire box must be enabled to have enabled individual bounds.

#### Reference

BoundingBoxXYZ Class

Autodesk.Revit.DB Namespace